Include("\\script\\global\\zid_jx\\log\\log.lua")
function main(nItemIndex)
	local G,D,P = GetItemProp(nItemIndex);
	local F = GetLastFactionNumber();
	if (F < 0) then
		Talk(1, "", "H×nh nh­ quyÓn s¸ch nµy miªu t¶ vâ c«ng cao cÊp cña c¸c ®¹i m«n ph¸i, ng­¬i kh«ng thÓ hiÓu sù huyÒn c¬ cña nã.");
	return (1) end;
	
	local TB_SKILL = {
		[4265] = {318,21},
		[4266] = {319,21},
		[4267] = {321,21},
		[4268] = {322,21},
		[4269] = {325,21},
		[4270] = {323,21},
		[4271] = {339,21},
		[4272] = {302,21},
		[4273] = {342,21},
		[4274] = {353,21},
		[4275] = {355,21},
		[4276] = {380,21},
		[4277] = {328,21},
		[4278] = {336,21},
		[4279] = {337,21},
		[4280] = {357,21},
		[4281] = {359,21},
		[4282] = {361,21},
		[4283] = {362,21},
		[4284] = {365,21},
		[4285] = {368,21},
		[4286] = {372,21},
		[4287] = {375,21},
		[4288] = {318,22},
		[4289] = {319,22},
		[4290] = {321,22},
		[4291] = {322,22},
		[4292] = {325,22},
		[4293] = {323,22},
		[4294] = {339,22},
		[4295] = {302,22},
		[4296] = {342,22},
		[4297] = {353,22},
		[4298] = {355,22},
		[4299] = {380,22},
		[4300] = {328,22},--
		[4301] = {336,22},
		[4302] = {337,22},
		[4303] = {357,22},
		[4304] = {359,22},
		[4305] = {361,22},
		[4306] = {362,22},
		[4307] = {365,22},
		[4308] = {368,22},
		[4309] = {372,22},
		[4310] = {375,22},
		[4311] = {318,23},
		[4312] = {319,23},
		[4313] = {321,23},
		[4314] = {322,23},
		[4315] = {325,23},
		[4316] = {323,23},
		[4317] = {339,23},
		[4318] = {302,23},
		[4319] = {342,23},
		[4320] = {353,23},
		[4321] = {355,23},
		[4322] = {380,23},
		[4323] = {328,23},
		[4324] = {336,23},
		[4325] = {337,23},
		[4326] = {357,23},
		[4327] = {359,23},
		[4328] = {361,23},
		[4329] = {362,23},
		[4330] = {365,23},
		[4331] = {368,23},
		[4332] = {372,23},
		[4333] = {375,23},
		[4334] = {318,24},
		[4335] = {319,24},
		[4336] = {321,24},
		[4337] = {322,24},
		[4338] = {325,24},
		[4339] = {323,24},
		[4340] = {339,24},
		[4341] = {302,24},
		[4342] = {342,24},
		[4343] = {353,24},
		[4344] = {355,24},
		[4345] = {380,24},
		[4346] = {328,24},
		[4347] = {336,24},
		[4348] = {337,24},
		[4349] = {357,24},
		[4350] = {359,24},
		[4351] = {361,24},
		[4352] = {362,24},
		[4353] = {365,24},
		[4354] = {368,24},
		[4355] = {372,24},
		[4356] = {375,24},
		[4357] = {318,25},
		[4358] = {319,25},
		[4359] = {321,25},
		[4360] = {322,25},
		[4361] = {325,25},
		[4362] = {323,25},
		[4363] = {339,25},
		[4364] = {302,25},
		[4365] = {342,25},
		[4366] = {353,25},
		[4367] = {355,25},
		[4368] = {380,25},
		[4369] = {328,25},
		[4370] = {336,25},
		[4371] = {337,25},
		[4372] = {357,25},
		[4373] = {359,25},
		[4374] = {361,25},
		[4375] = {362,25},
		[4376] = {365,25},
		[4377] = {368,25},
		[4378] = {372,25},
		[4379] = {375,25},
	};
	
	if (not TB_SKILL[P]) then
		Talk(1,"","QuyÓn s¸ch nµy cã vÊn ®Ò, vui lßng liªn hÖ víi GM!");
	return (1) end;
	
	local L = HaveMagic(TB_SKILL[P][1]);
	if (L < 0) then
		Talk(1,"",format("B¹n ch­a lÜnh ngé ®­îc kü n¨ng <color=red>%s<color>, kh«ng thÓ n©ng cÊp kü n¨ng nµy!",GetSkillName(TB_SKILL[P][1])));
	return (1) end;
	
	if (L ~= (TB_SKILL[P][2]-1)) then
		Talk(1,"",format("Kü n¨ng <color=red>%s<color> cña b¹n ch­a ®¹t cÊp <color=red>%d<color>, kh«ng thÓ n©ng cÊp lªn cÊp <color=red>%d<color> ®­îc!",GetSkillName(TB_SKILL[P][1]),(TB_SKILL[P][2]-1),TB_SKILL[P][2]));
	return (1) end;
	
	if (L >= TB_SKILL[P][2]) then
		Talk(1,"",format("Kü n¨ng <color=red>%s<color> cña b¹n ®· ®¹t cÊp <color=red>%d<color> trë lªn råi, kh«ng thÓ n©ng cÊp ®­îc n÷a!",GetSkillName(TB_SKILL[P][1]),TB_SKILL[P][2]));
	return (1) end;
	
	if (ConsumeItem(3,1,G,D,P,-1) == 1) then
		local i = AddMagic(TB_SKILL[P][1],TB_SKILL[P][2]);
		local e = GetSkillName(i);
		local x = TB_SKILL[P][2];
		Msg2Player(format("Chóc mõng b¹n ®· n©ng cÊp kü n¨ng <color=yellow>%s (cÊp %d)<color> thµnh c«ng!",GetSkillName(TB_SKILL[P][1]),TB_SKILL[P][2]));
		SaveLogs("sachkynang", format("[%s] | Nh©n VËt : %s | Tµi Kho¶n :(%s) | n©ng cÊp kü n¨ng <color=yellow>%s (cÊp %d)<color> thµnh c«ng!",date("%H:%M:%S - %d/%m/%Y"),GetName(),GetAccount(),GetSkillName(TB_SKILL[P][1]),TB_SKILL[P][2]));
		return 0;
	else
		Talk(1,"","X¶y ra lçi khi khÊu trõ, vui lßng liªn hÖ víi GM!");
		return 1;
	end;
end;